---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RoofFailures
source: html/606c95ae-28f6-1529-2184-6dd4e9bedf20.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures

Failures about Roof.

## Syntax (C#)
```csharp
public static class RoofFailures
```